In [1]:
import numpy as np
import pandas as pd

# Example 1
check null values

In [3]:
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dict)

df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [4]:
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dict)

df.notnull()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

In [5]:
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dict)

df.isnull().sum().sum()

3

# fill null value by 0

In [7]:
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dict)

df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [8]:
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dict)

df.fillna(5.6)

   First Score  Second Score  Third Score
0        100.0          30.0          5.6
1         90.0          45.0         40.0
2          5.6          56.0         80.0
3         95.0           5.6         98.0

In [9]:
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dict)

df.fillna('chanchal')

  First Score Second Score Third Score
0       100.0         30.0    chanchal
1        90.0         45.0        40.0
2    chanchal         56.0        80.0
3        95.0     chanchal        98.0

In [10]:
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dict)

df.fillna(df.mean())

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

In [11]:
df.min()

First Score     90.0
Second Score    30.0
Third Score     40.0
dtype: float64

In [12]:
df.fillna(df.min())

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          30.0         98.0

In [13]:
df.max()

First Score     100.0
Second Score     56.0
Third Score      98.0
dtype: float64

In [14]:
df.fillna(df.max())

   First Score  Second Score  Third Score
0        100.0          30.0         98.0
1         90.0          45.0         40.0
2        100.0          56.0         80.0
3         95.0          56.0         98.0

In [15]:
df.std()

First Score      5.000000
Second Score    13.051181
Third Score     29.687259
dtype: float64

In [16]:
df.fillna(df.std())

   First Score  Second Score  Third Score
0        100.0     30.000000    29.687259
1         90.0     45.000000    40.000000
2          5.0     56.000000    80.000000
3         95.0     13.051181    98.000000

# Fill null value by forward padding

In [18]:
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, 45, 56, np.nan], 
        'Third Score':[np.nan, 40, 80, 98]} 
  
# creating a dataframe from list 
df = pd.DataFrame(dict)

df.fillna(method='pad')      #or  use ffill method

C:\Users\HP\AppData\Local\Temp\ipykernel_7240\2052791618.py:8: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='pad')      #or  use ffill method

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

In [19]:
df.ffill()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

# Fill null value by backaward padding

In [21]:
df.fillna(method='bfill')

C:\Users\HP\AppData\Local\Temp\ipykernel_7240\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

# Create a DataFrame

In [23]:
# dictionary of lists 
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, 40, 80, 98], 
        'Fourth Score':[np.nan, np.nan, np.nan, 65]} 
  
# creating a dataframe from dictionary 
df = pd.DataFrame(dict)

df.isna()

   First Score  Second Score  Third Score  Fourth Score
0        False         False        False          True
1        False          True        False          True
2         True         False        False          True
3        False         False        False         False

In [24]:
df.isna().sum().sum()

5

In [25]:
df.fillna(0)

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           0.0
1         90.0           0.0           40           0.0
2          0.0          45.0           80           0.0
3         95.0          56.0           98          65.0

In [26]:
df.mean()

First Score     95.000000
Second Score    43.666667
Third Score     67.500000
Fourth Score    65.000000
dtype: float64

In [34]:
df.fillna(df.mean())

   First Score  Second Score  Third Score  Fourth Score
0        100.0     30.000000           52          65.0
1         90.0     43.666667           40          65.0
2         95.0     45.000000           80          65.0
3         95.0     56.000000           98          65.0

In [50]:
df.std()

First Score      5.000000
Second Score    13.051181
Third Score     26.350206
Fourth Score          NaN
dtype: float64

In [52]:
df.fillna(df.std())

   First Score  Second Score  Third Score  Fourth Score
0        100.0     30.000000           52           NaN
1         90.0     13.051181           40           NaN
2          5.0     45.000000           80           NaN
3         95.0     56.000000           98          65.0

In [53]:
df.ffill()

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0          30.0           40           NaN
2         90.0          45.0           80           NaN
3         95.0          56.0           98          65.0

In [54]:
df.bfill()

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52          65.0
1         90.0          45.0           40          65.0
2         95.0          45.0           80          65.0
3         95.0          56.0           98          65.0

# Drop all rows which contain one or more null values

In [57]:
dict = {'First Score':[100, 90, np.nan, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, 40, 80, 98], 
        'Fourth Score':[np.nan, np.nan, np.nan, 65]} 
  
# creating a dataframe from dictionary 
df = pd.DataFrame(dict)
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [58]:
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

# Create a new df

In [61]:
# dictionary of lists 
dict = {'First Score':[100, np.nan, np.nan, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, np.nan, 80, 98], 
        'Fourth Score':[np.nan, np.nan, np.nan, 65]} 
  
# creating a dataframe from dictionary 
df = pd.DataFrame(dict)
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0           NaN
1          NaN           NaN          NaN           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0

# Drop all rows which contain all null values

In [63]:
df.dropna(how='all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0

# Create new df

In [70]:
# dictionary of lists 
dict = {'First Score':[100, np.nan, np.nan, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, np.nan, 80, 98], 
        'Fourth Score':[60, 67, 68, 65]} 
  
# creating a dataframe from dictionary  
df = pd.DataFrame(dict) 
     
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0            60
1          NaN           NaN          NaN            67
2          NaN          45.0         80.0            68
3         95.0          56.0         98.0            65

# Drop all rows with any null value on the basis of axis

In [73]:
# dictionary of lists 
dict = {'First Score':[100, np.nan, np.nan, 95], 
        'Second Score': [30, np.nan, 45, 56], 
        'Third Score':[52, np.nan, 80, 98], 
        'Fourth Score':[60, 67, 68, 65]} 
  
# creating a dataframe from dictionary  
df = pd.DataFrame(dict) 

#using dropna() func
df.dropna(axis=1)          # axis =1(columns) , axis=0 (rows)

   Fourth Score
0            60
1            67
2            68
3            65

In [74]:
df.dropna(axis=1,how='all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0            60
1          NaN           NaN          NaN            67
2          NaN          45.0         80.0            68
3         95.0          56.0         98.0            65

In [75]:
df.dropna(axis=0)

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0            60
3         95.0          56.0         98.0            65

In [76]:
df.dropna(axis=0,how='all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0            60
1          NaN           NaN          NaN            67
2          NaN          45.0         80.0            68
3         95.0          56.0         98.0            65

# Create df

In [80]:
dataset = pd.DataFrame(np.random.randn(5,3),
                      index=['a','c','e','f','h'],
                      columns=['stock1','stock2','stock3'])
dataset = dataset.reindex(['a','b','c','d','e','f','g','h'])
print(dataset)

     stock1    stock2    stock3
a -0.420262  0.693424  0.455038
b       NaN       NaN       NaN
c -1.424154 -0.594937  1.128147
d       NaN       NaN       NaN
e -0.542163  0.198117 -0.727463
f  1.307785 -0.370301  0.464004
g       NaN       NaN       NaN
h  0.191532  0.993393  2.883558

# Checking missing values

In [83]:
dataset.stock1.isnull().sum()

3

In [85]:
dataset.isnull().sum().sum()

9

In [86]:
dataset.isnull()

   stock1  stock2  stock3
a   False   False   False
b    True    True    True
c   False   False   False
d    True    True    True
e   False   False   False
f   False   False   False
g    True    True    True
h   False   False   False

In [87]:
dataset.isnull().any()

stock1    True
stock2    True
stock3    True
dtype: bool

In [88]:
dataset.isnull().any().sum()

3

In [89]:
dataset.isnull().sum()

stock1    3
stock2    3
stock3    3
dtype: int64

In [91]:
dataset.notna()

   stock1  stock2  stock3
a    True    True    True
b   False   False   False
c    True    True    True
d   False   False   False
e    True    True    True
f    True    True    True
g   False   False   False
h    True    True    True

In [92]:
dataset.notnull()

   stock1  stock2  stock3
a    True    True    True
b   False   False   False
c    True    True    True
d   False   False   False
e    True    True    True
f    True    True    True
g   False   False   False
h    True    True    True

In [94]:
dataset.notnull().sum()

stock1    5
stock2    5
stock3    5
dtype: int64

# Handling missing values

In [98]:
print(dataset)

     stock1    stock2    stock3
a -0.420262  0.693424  0.455038
b       NaN       NaN       NaN
c -1.424154 -0.594937  1.128147
d       NaN       NaN       NaN
e -0.542163  0.198117 -0.727463
f  1.307785 -0.370301  0.464004
g       NaN       NaN       NaN
h  0.191532  0.993393  2.883558

# Replace NAN with scalar value

In [100]:
dataset.fillna(0)

     stock1    stock2    stock3
a -0.420262  0.693424  0.455038
b  0.000000  0.000000  0.000000
c -1.424154 -0.594937  1.128147
d  0.000000  0.000000  0.000000
e -0.542163  0.198117 -0.727463
f  1.307785 -0.370301  0.464004
g  0.000000  0.000000  0.000000
h  0.191532  0.993393  2.883558

In [109]:
dataset.fillna('chanchal')

     stock1    stock2    stock3
a -0.420262  0.693424  0.455038
b  chanchal  chanchal  chanchal
c -1.424154 -0.594937  1.128147
d  chanchal  chanchal  chanchal
e -0.542163  0.198117 -0.727463
f  1.307785 -0.370301  0.464004
g  chanchal  chanchal  chanchal
h  0.191532  0.993393  2.883558

# case1

In [111]:
sales=pd.read_csv('sales.csv')

In [112]:
sales

,SALES_ID,SALES_BY_REGION,JANUARY,FEBRUARY,MARCH,APRIL,MAY,JUNE,JULY,AUGUST,SEPTEMBER,OCTOBER,NOVEMBER,DECEMBER
0,1,AUH,"3,469.00",n.a.,not avilable,"3,642.00","5,803.00","5,662.00","1,896.00","2,293.00","2,583.00","5,233.00","4,421.00","4,071.00"
1,1,SHJ,"5,840.00","5,270.00","4,114.00","5,605.00","4,387.00","5,026.00","4,055.00","2,782.00","4,578.00","4,993.00","2,859.00","4,853.00"
2,1,-1,"2,967.00","2,425.00","5,353.00",n.a.,"5,027.00","4,078.00","3,858.00","1,927.00","3,527.00","4,179.00","1,571.00","5,551.00"
3,2,AUH,"1,328.00",-1,"1,574.00","2,343.00","3,826.00","4,932.00","1,710.00","3,221.00","3,381.00","1,313.00","1,765.00","1,214.00"
4,3,SHJ,"2,473.00","1,421.00","3,606.00","1,314.00","1,413.00","2,091.00","3,270.00","3,346.00","2,080.00","1,539.00","2,630.00","1,697.00"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
93,29,FUJ,"2,492.00","1,833.00","2,982.00","4,292.00","5,540.00","5,847.00",909,"2,339.00","4,868.00","5,207.00","5,938.00","1,793.00"
94,30,AJM,"2,832.00","5,978.00","1,684.00","1,550.00","1,194.00","3,737.00","5,779.00","4,441.00","1,213.00","3,711.00","5,384.00","1,293.00"
95,30,FUJ,"3,402.00","5,283.00","2,229.00","3,758.00","1,427.00","1,057.00","5,277.00","5,231.00","3,909.00","4,345.00","5,287.00","2,638.00"
96,30,AJM,"2,028.00","2,006.00","5,120.00","5,959.00","3,127.00","3,962.00","4,780.00","3,200.00","1,836.00","2,623.00","1,607.00","2,371.00"
97,30,FUJ,"5,549.00","1,302.00","1,929.00","2,822.00","5,379.00","1,243.00","3,075.00","4,358.00","5,106.00","2,322.00","2,409.00","1,069.00"

In [113]:
sales.isna()

,SALES_ID,SALES_BY_REGION,JANUARY,FEBRUARY,MARCH,APRIL,MAY,JUNE,JULY,AUGUST,SEPTEMBER,OCTOBER,NOVEMBER,DECEMBER
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
93,False,False,False,False,False,False,False,False,False,False,False,False,False,False
94,False,False,False,False,False,False,False,False,False,False,False,False,False,False
95,False,False,False,False,False,False,False,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [114]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 98 entries, 0 to 97
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   SALES_ID         98 non-null     int64
 1   SALES_BY_REGION  98 non-null     object
 2   JANUARY          98 non-null     object
 3   FEBRUARY         98 non-null     object
 4   MARCH            98 non-null     object
 5   APRIL            98 non-null     object
 6   MAY              98 non-null     object
 7   JUNE             98 non-null     object
 8   JULY             98 non-null     object
 9   AUGUST           98 non-null     object
 10  SEPTEMBER        98 non-null     object
 11  OCTOBER          98 non-null     object
 12  NOVEMBER         98 non-null     object
 13  DECEMBER         98 non-null     object
dtypes: int64(1), object(13)
memory usage: 10.8+ KB

In [115]:
sales.isna().sum()

SALES_ID           0
SALES_BY_REGION    0
JANUARY            0
FEBRUARY           0
MARCH              0
APRIL              0
MAY                0
JUNE               0
JULY               0
AUGUST             0
SEPTEMBER          0
OCTOBER            0
NOVEMBER           0
DECEMBER           0
dtype: int64

In [117]:
sales.isna().sum().sum()

0

In [118]:
sales.SALES_BY_REGION.value_counts()

SALES_BY_REGION
AJM             20
SHJ             15
FUJ             15
DXB             15
AUH             13
RAK              9
UAQ              8
-1               2
not avilable     1
Name: count, dtype: int64

In [120]:
sales.JANUARY.value_counts()

JANUARY
n.a.        4
-1          2
3,469.00    1
4,275.00    1
3,435.00    1
           ..
4,075.00    1
5,782.00    1
5,172.00    1
1,614.00    1
5,549.00    1
Name: count, Length: 94, dtype: int64

In [121]:
sales.FEBRUARY.value_counts()

FEBRUARY
1,397.00    2
n.a.        1
5,226.00    1
5,624.00    1
4,180.00    1
           ..
3,164.00    1
3,173.00    1
1,537.00    1
4,640.00    1
1,302.00    1
Name: count, Length: 97, dtype: int64

In [123]:
sales.MARCH.value_counts()

MARCH
n.a.        2
3,981.00    2
1,887.00    1
3,133.00    1
1,798.00    1
           ..
930         1
3,093.00    1
1,576.00    1
2,336.00    1
1,929.00    1
Name: count, Length: 96, dtype: int64

In [124]:
sales.APRIL.value_counts()

APRIL
4,715.00    2
3,642.00    1
1,355.00    1
1,018.00    1
3,803.00    1
           ..
1,994.00    1
2,592.00    1
4,525.00    1
5,531.00    1
2,822.00    1
Name: count, Length: 97, dtype: int64

In [125]:
sales.MAY.value_counts()

MAY
5,803.00    1
938         1
4,830.00    1
4,870.00    1
2,770.00    1
           ..
1,924.00    1
3,592.00    1
3,747.00    1
1,483.00    1
5,379.00    1
Name: count, Length: 98, dtype: int64

In [126]:
sales.JUNE.value_counts()

JUNE
3,074.00    2
n.a.        2
5,662.00    1
3,739.00    1
4,805.00    1
           ..
5,040.00    1
5,357.00    1
3,300.00    1
2,202.00    1
1,243.00    1
Name: count, Length: 96, dtype: int64

In [127]:
sales.JULY.value_counts()

JULY
3,270.00    2
1,101.00    2
1,896.00    1
3,221.00    1
2,084.00    1
           ..
1,973.00    1
3,371.00    1
2,283.00    1
2,015.00    1
3,075.00    1
Name: count, Length: 96, dtype: int64

In [129]:
sales.AUGUST.value_counts()

AUGUST
3,221.00    2
n.a.        2
2,293.00    1
3,388.00    1
3,924.00    1
           ..
3,054.00    1
3,972.00    1
5,250.00    1
2,671.00    1
4,358.00    1
Name: count, Length: 96, dtype: int64

In [130]:
sales.SEPTEMBER.value_counts()

SEPTEMBER
4,578.00    2
4,310.00    1
4,298.00    1
989         1
2,807.00    1
           ..
1,550.00    1
1,918.00    1
5,529.00    1
3,785.00    1
5,106.00    1
Name: count, Length: 97, dtype: int64

In [137]:
sales.OCTOBER.value_counts()

OCTOBER
1,110.00    2
1,500.00    2
5,233.00    1
5,736.00    1
3,482.00    1
           ..
1,804.00    1
2,449.00    1
5,942.00    1
4,173.00    1
2,322.00    1
Name: count, Length: 96, dtype: int64

In [146]:
sales.NOVEMBER.value_counts()

NOVEMBER
4,969.00    2
4,421.00    1
5,559.00    1
2,006.00    1
3,999.00    1
           ..
1,656.00    1
1,531.00    1
901         1
5,686.00    1
2,409.00    1
Name: count, Length: 97, dtype: int64

In [148]:
sales.DECEMBER.value_counts()

DECEMBER
4,071.00    1
5,951.00    1
5,594.00    1
2,884.00    1
3,425.00    1
           ..
4,904.00    1
4,984.00    1
3,420.00    1
3,190.00    1
1,069.00    1
Name: count, Length: 98, dtype: int64

In [149]:
sales.columns[:3].value_counts()

SALES_ID           1
SALES_BY_REGION    1
JANUARY            1
Name: count, dtype: int64

In [152]:
sales_new=pd.read_csv('sales.csv')